// articles-data.js
const articles = [
  {
    title: "Развитие профессионального мастерства педагога",
    imgSrc: "../img/mas_ped.jpg",
    pageLink: "../blog/razvitie_masterstva_pedagoga.html",
    imgAlt: "Мастерство педагога",
    description: "Конкурсы педагогического мастерства — мощный ресурс для профессионального роста. Как перенести конкурсный опыт в повседневную работу и повысить качество образования?"
  },
  {
    title: "Цифровые инструменты в образовании",
    imgSrc: "../img/cifr_ins.jpg",
    pageLink: "../blog/cifrovye_instrumenty_obrazovanie.html",
    imgAlt: "Цифровые инструменты",
    description: "Современные цифровые инструменты помогают сделать обучение интерактивным и персонализированным. Обзор платформ и методик интеграции."
  },
  {
    title: "Промт-грамотность как новая компетенция в обучении математике",
    imgSrc: "../img/promt_gram.jpg",
    pageLink: "../blog/promt_gramotnost_matematika.html",
    imgAlt: "Промт-грамотность",
    description: "Формирование prompt-грамотности у учащихся: как научить эффективно взаимодействовать с ИИ на уроках математики, развивая критическое мышление."
  },
  {
    title: "Формирование ценностных ориентиров через решение математических задач ",
    imgSrc: "../img/cen_or.jpg",
    pageLink: "../blog/cennostnye_orientiry_matematika.html",
    imgAlt: "Ценностные ориентиры",
    description: "Контекстные задачи экологической и социальной направленности как инструмент воспитания ответственности и формирования ценностных ориентиров школьников."
  }
];